MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MC504/mcu.h
#define _CTMUCON2_EDG1SEL3_POSITION              0x0000000D
#define _CTMUCON2_EDG1SEL3_MASK                  0x00002000
#define _CTMUCON2_EDG1SEL3_LENGTH                0x00000001

#define _CTMUICON_IRNG_POSITION                  0x00000008
#define _CTMUICON_IRNG_MASK                      0x00000300
#define _CTMUICON_IRNG_LENGTH                    0x00000002

#define _CTMUICON_ITRIM_POSITION                 0x0000000A
#define _CTMUICON_ITRIM_MASK                     0x0000FC00
#define _CTMUICON_ITRIM_LENGTH                   0x00000006

#define _CTMUICON_IRNG0_POSITION                 0x00000008
#define _CTMUICON_IRNG0_MASK                     0x00000100
#define _CTMUICON_IRNG0_LENGTH                   0x00000001

#define _CTMUICON_IRNG1_POSITION                 0x00000009
#define _CTMUICON_IRNG1_MASK                     0x00000200
#define _CTMUICON_IRNG1_LENGTH                   0x00000001

#define _CTMUICON_ITRIM0_POSITION                0x0000000A
#define _CTMUICON_ITRIM0_MASK                    0x00000400
#define _CTMUICON_ITRIM0_LENGTH                  0x00000001

#define _CTMUICON_ITRIM1_POSITION                0x0000000B
#define _CTMUICON_ITRIM1_MASK                    0x00000800
#define _CTMUICON_ITRIM1_LENGTH                  0x00000001

#define _CTMUICON_ITRIM2_POSITION                0x0000000C
#define _CTMUICON_ITRIM2_MASK                    0x00001000
#define _CTMUICON_ITRIM2_LENGTH                  0x00000001

#define _CTMUICON_ITRIM3_POSITION                0x0000000D
#define _CTMUICON_ITRIM3_MASK                    0x00002000
#define _CTMUICON_ITRIM3_LENGTH                  0x00000001

#define _CTMUICON_ITRIM4_POSITION                0x0000000E
#define _CTMUICON_ITRIM4_MASK                    0x00004000
#define _CTMUICON_ITRIM4_LENGTH                  0x00000001

#define _CTMUICON_ITRIM5_POSITION                0x0000000F
#define _CTMUICON_ITRIM5_MASK                    0x00008000
#define _CTMUICON_ITRIM5_LENGTH                  0x00000001

#define _C1CTRL1_WIN_POSITION                    0x00000000
#define _C1CTRL1_WIN_MASK                        0x00000001
#define _C1CTRL1_WIN_LENGTH                      0x00000001

#define _C1CTRL1_CANCAP_POSITION                 0x00000003
#define _C1CTRL1_CANCAP_MASK                     0x00000008
#define _C1CTRL1_CANCAP_LENGTH                   0x00000001

#define _C1CTRL1_OPMODE_POSITION                 0x00000005
#define _C1CTRL1_OPMODE_MASK                     0x000000E0
#define _C1CTRL1_OPMODE_LENGTH                   0x00000003

#define _C1CTRL1_REQOP_POSITION                  0x00000008
#define _C1CTRL1_REQOP_MASK                      0x00000700
#define _C1CTRL1_REQOP_LENGTH                    0x00000003

#define _C1CTRL1_CANCKS_POSITION                 0x0000000B
#define _C1CTRL1_CANCKS_MASK                     0x00000800
#define _C1CTRL1_CANCKS_LENGTH                   0x00000001

#define _C1CTRL1_ABAT_POSITION                   0x0000000C
#define _C1CTRL1_ABAT_MASK                       0x00001000
#define _C1CTRL1_ABAT_LENGTH                     0x00000001

#define _C1CTRL1_CSIDL_POSITION                  0x0000000D
#define _C1CTRL1_CSIDL_MASK                      0x00002000
#define _C1CTRL1_CSIDL_LENGTH                    0x00000001

#define _C1CTRL1_OPMODE0_POSITION                0x00000005
#define _C1CTRL1_OPMODE0_MASK                    0x00000020
#define _C1CTRL1_OPMODE0_LENGTH                  0x00000001

#define _C1CTRL1_OPMODE1_POSITION                0x00000006
#define _C1CTRL1_OPMODE1_MASK                    0x00000040
#define _C1CTRL1_OPMODE1_LENGTH                  0x00000001

#define _C1CTRL1_OPMODE2_POSITION                0x00000007
#define _C1CTRL1_OPMODE2_MASK                    0x00000080
#define _C1CTRL1_OPMODE2_LENGTH                  0x00000001

#define _C1CTRL1_REQOP0_POSITION                 0x00000008
#define _C1CTRL1_REQOP0_MASK                     0x00000100
#define _C1CTRL1_REQOP0_LENGTH                   0x00000001

#define _C1CTRL1_REQOP1_POSITION                 0x00000009
#define _C1CTRL1_REQOP1_MASK                     0x00000200
#define _C1CTRL1_REQOP1_LENGTH                   0x00000001

#define _C1CTRL1_REQOP2_POSITION                 0x0000000A
#define _C1CTRL1_REQOP2_MASK                     0x00000400
#define _C1CTRL1_REQOP2_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT_POSITION                  0x00000000
#define _C1CTRL2_DNCNT_MASK                      0x0000001F
#define _C1CTRL2_DNCNT_LENGTH                    0x00000005

#define _C1CTRL2_DNCNT0_POSITION                 0x00000000
#define _C1CTRL2_DNCNT0_MASK                     0x00000001
#define _C1CTRL2_DNCNT0_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT1_POSITION                 0x00000001
#define _C1CTRL2_DNCNT1_MASK                     0x00000002
#define _C1CTRL2_DNCNT1_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT2_POSITION                 0x00000002
#define _C1CTRL2_DNCNT2_MASK                     0x00000004
#define _C1CTRL2_DNCNT2_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT3_POSITION                 0x00000003
#define _C1CTRL2_DNCNT3_MASK                     0x00000008
#define _C1CTRL2_DNCNT3_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT4_POSITION                 0x00000004
#define _C1CTRL2_DNCNT4_MASK                     0x00000010
#define _C1CTRL2_DNCNT4_LENGTH                   0x00000001

#define _C1VEC_ICODE_POSITION                    0x00000000
#define _C1VEC_ICODE_MASK                        0x0000007F
#define _C1VEC_ICODE_LENGTH                      0x00000007

#define _C1VEC_FILHIT_POSITION                   0x00000008
#define _C1VEC_FILHIT_MASK                       0x00001F00
#define _C1VEC_FILHIT_LENGTH                     0x00000005

#define _C1VEC_ICODE0_POSITION                   0x00000000
#define _C1VEC_ICODE0_MASK                       0x00000001
#define _C1VEC_ICODE0_LENGTH                     0x00000001

#define _C1VEC_ICODE1_POSITION                   0x00000001
#define _C1VEC_ICODE1_MASK                       0x00000002
#define _C1VEC_ICODE1_LENGTH                     0x00000001

